Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеПечатьюЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт

	//++ Локализация
	
	//++ НЕ БЗК
	
	СписокОбъектов.Добавить(Документы.ВводОстатковТМЦВЭксплуатации);
	СписокОбъектов.Добавить(Документы.ЛистКассовойКниги);
	СписокОбъектов.Добавить(Документы.ТранспортнаяНакладная);
	
    
    СписокОбъектов.Добавить(Документы.КорректировкаНалоговогоНазначенияЗапасов);
	
	
	
	
	
	
	
	//-- НЕ БЗК
	

	
	
	
	//-- Локализация
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией УправлениеПечатью.КомандыПечатиФормы.
// Используется для общих форм, у которых нет модуля менеджера для размещения в нем процедуры ДобавитьКомандыПечати,
// для случаев, когда штатных средств добавления команд в такие формы недостаточно. Например, если нужны свои команды,
// которых нет в других объектах.
// 
// Параметры:
//  ИмяФормы             - Строка - полное имя формы, в которой добавляются команды печати;
//  КомандыПечати        - ТаблицаЗначений - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати;
//  СтандартнаяОбработка - Булево - при установке значения Ложь не будет автоматически заполняться коллекция КомандыПечати.
//
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
	//++ Локализация 
	//++ НЕ БЗК
	Если ИмяФормы = "ЖурналДокументов.ИсходящиеНалоговыеДокументы.Форма.ФормаСписка"
	 ИЛИ ИмяФормы = "ЖурналДокументов.ИсходящиеНалоговыеДокументы.Форма.ОформлениеНалоговыхДокументовПоРегистратору" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Документы.НалоговаяНакладная.ДобавитьКомандыПечати(КомандыПечати);
		Для Каждого КомандаПечати Из КомандыПечати Цикл
			Если ПустаяСтрока(КомандаПечати.Обработчик) И ПустаяСтрока(КомандаПечати.МенеджерПечати) Тогда
				КомандаПечати.МенеджерПечати = "Документ.НалоговаяНакладная";
			КонецЕсли;
			КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.НалоговаяНакладная"));
		КонецЦикла;
		
		ДобавляемыеКомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
		Документы.Приложение2КНалоговойНакладной.ДобавитьКомандыПечати(ДобавляемыеКомандыПечати);
		Для Каждого КомандаПечати Из ДобавляемыеКомандыПечати Цикл
			Если ПустаяСтрока(КомандаПечати.Обработчик) И ПустаяСтрока(КомандаПечати.МенеджерПечати) Тогда
				КомандаПечати.МенеджерПечати = "Документ.Приложение2КНалоговойНакладной";
			КонецЕсли;
			Отбор = Новый Структура("Идентификатор,Представление,МенеджерПечати,Обработчик");
			ЗаполнитьЗначенияСвойств(Отбор, КомандаПечати);
			НайденныеКоманды = КомандыПечати.НайтиСтроки(Отбор);
			КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.Приложение2КНалоговойНакладной"));
			Если НайденныеКоманды.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(КомандыПечати.Добавить(), КомандаПечати);
			Иначе
				Для каждого КомандаПечати Из НайденныеКоманды Цикл
					КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.Приложение2КНалоговойНакладной"));
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, "Документ.НалоговаяНакладная");
		ДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, "Документ.Приложение2КНалоговойНакладной");
        
    ИначеЕсли ИмяФормы = "ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Форма.ФормаСписка" Тогда
		
		СтандартнаяОбработка = Ложь;
        
		Документы.ОтчетОРозничныхПродажах.ДобавитьКомандыПечати(КомандыПечати);
		Для Каждого КомандаПечати Из КомандыПечати Цикл
			Если ПустаяСтрока(КомандаПечати.Обработчик) И ПустаяСтрока(КомандаПечати.МенеджерПечати) Тогда
				КомандаПечати.МенеджерПечати = "Документ.ОтчетОРозничныхПродажах";
			КонецЕсли;
			КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
		КонецЦикла;
		
		ДобавляемыеКомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
		Документы.ОтчетОРозничнойВыручке.ДобавитьКомандыПечати(ДобавляемыеКомандыПечати);
		Для Каждого КомандаПечати Из ДобавляемыеКомандыПечати Цикл
			Если ПустаяСтрока(КомандаПечати.Обработчик) И ПустаяСтрока(КомандаПечати.МенеджерПечати) Тогда
				КомандаПечати.МенеджерПечати = "Документ.ОтчетОРозничнойВыручке";
			КонецЕсли;
			Отбор = Новый Структура("Идентификатор,Представление,МенеджерПечати,Обработчик");
			ЗаполнитьЗначенияСвойств(Отбор, КомандаПечати);
			НайденныеКоманды = КомандыПечати.НайтиСтроки(Отбор);
			КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.ОтчетОРозничнойВыручке"));
			Если НайденныеКоманды.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(КомандыПечати.Добавить(), КомандаПечати);
			Иначе
				Для каждого КомандаПечати Из НайденныеКоманды Цикл
					КомандаПечати.ТипыОбъектовПечати.Добавить(Тип("ДокументСсылка.ОтчетОРозничнойВыручке"));
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, "Документ.ОтчетОРозничныхПродажах");
		ДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, "Документ.ОтчетОРозничнойВыручке");
        
    КонецЕсли;
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры

// Дополнительные настройки списка команд печати в журналах документов.
//
// см. УправлениеПечатьюПереопределяемый.ПриПолученииНастроекСпискаКомандПечати()
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Дополняет сведения о юр/физлице
//
// Параметры:
//  СписокПолей - Строка - список полей структуры ФормированиеПечатныхФорм.СведенияОЮрФизЛице
//
Процедура ДополнитьСведенияОЮрФизЛицеВСпискеПолей(СписокПолей) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Формирует сведения об указанном юридическом или физическом лице.
// К сведениям относятся: наименование, адрес, номер телефона, банковские реквизиты.
//
// Параметры: 
//  Сведения - Структура - собранные сведения.
//  Реквизиты - Структура - реквизиты ЮрФизЛице.
//  ЮрФизЛицо   - организация или физическое лицо, о котором собираются сведения.
//  ДатаПериода - дата, на которую выбираются сведения о ЮрФизЛице.
//
Процедура ДополнитьСведенияОЮрФизЛице(Сведения, Реквизиты, ЮрФизЛицо, ДатаПериода) Экспорт
	//++ Локализация
    Если ЗначениеЗаполнено(ЮрФизЛицо)
       И (ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации")
    	ИЛИ ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты")) Тогда
    
    	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
    	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
    		Сведения.Вставить("НалоговыйНомерВСтранеРегистрации", Реквизиты.НалоговыйНомер);
    		Сведения.Вставить("СтранаРегистрации", Реквизиты.СтранаРегистрации);
    	КонецЕсли;
        РеквизитЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ЮрФизЛицо");
		//++ НЕ БЗК
		Сведения.Вставить("ИНН", 						 Реквизиты.ИННПлательщикаНДС);
		//-- НЕ БЗК
		Если РеквизитЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Сведения.Вставить("КодПоЕДРПОУ", Реквизиты.КодПоЕДРПОУ);
		ИначеЕсли РеквизитЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			Сведения.Вставить("КодПоЕДРПОУ", Реквизиты.КодПоЕДРПОУ);
		Иначе
			Сведения.Вставить("КодПоДРФО", Реквизиты.КодПоЕДРПОУ);
        КонецЕсли;
		//++ НЕ БЗК
        Сведения.Вставить("НомерСвидетельства", Реквизиты.НомерСвидетельстваПлательщикаНДС);
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			Сведения.Вставить("ИнформацияОСтатусеПлательщикаНалогов", Реквизиты.ИнформацияОСтатусеПлательщикаНалогов);
		Иначе
			Сведения.Вставить("ИнформацияОСтатусеПлательщикаНалогов", "");			
		КонецЕсли;
    	Если РеквизитЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
            Сведения.Вставить("КодФилиала", Реквизиты.КодФилиала);
    	Иначе
            Сведения.Вставить("КодФилиала", "");
		КонецЕсли;
		//-- НЕ БЗК
    	
    КонецЕсли;
    
    //-- Локализация
КонецПроцедуры

// Дополняет сведения о банковском счете
//
// Параметры:
//  РеквизитыСчета - Структура - реквизиты счета
//  Сведения - Структура - собранные сведения.
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций - ссылка на счет.
//
Процедура ДополнитьСведенияОБанковскомСчете(РеквизитыСчета, Сведения, БанковскийСчет) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры
 
// Дополняет окончание для адреса из контактной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//  Окончание - Строка - представление найденного адреса.
//
Процедура ДополнитьОкончаниеАдресаИзКонтактнойИнформации(Объект, Окончание) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Формирует форматную строку согласно "Унифицированному формату электронных банковских сообщений" для ее отображения в
// виде QR-кода.
// 
// Параметры:
// 	ТекстСтроки - Строка - Параметр, в котором возвращается строка для формирования QR-кода.
// 	ДанныеДокумента  - Структура - Содержит значения полей документа.
// 
Процедура СформироватьСтрокуВФорматеЭлектронныхБанковскихСообщений(ТекстСтроки, ДанныеДокумента) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеСтруктурыПолучателяПоТипуОбъекта(ПолноеИмяОбъектаМетаданных , СтруктураДанныхОбъектаПечати) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти
